experiments/results/fio-rand/5-exfat-bento-randread-24.txt
/mnt/test_file: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 24 processes

/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21414: Thu Aug 21 04:41:17 2025
  read: IOPS=15.8k, BW=61.8MiB/s (64.8MB/s)(618MiB/10001msec)
    clat (usec): min=3, max=666, avg=62.59, stdev=21.99
     lat (usec): min=3, max=666, avg=62.64, stdev=21.99
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   50], 10.00th=[   52], 20.00th=[   53],
     | 30.00th=[   55], 40.00th=[   56], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  102],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  210], 99.95th=[  233],
     | 99.99th=[  293]
   bw (  KiB/s): min=58808, max=66776, per=4.21%, avg=63580.63, stdev=2798.53, samples=19
   iops        : min=14702, max=16694, avg=15895.16, stdev=699.63, samples=19
  lat (usec)   : 4=0.13%, 10=2.72%, 20=0.78%, 50=1.27%, 100=89.62%
  lat (usec)   : 250=5.44%, 500=0.03%, 750=0.01%
  cpu          : usr=1.90%, sys=14.82%, ctx=152181, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=158268,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21415: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.2MiB/s (64.2MB/s)(612MiB/10001msec)
    clat (usec): min=3, max=8824, avg=63.24, stdev=31.35
     lat (usec): min=3, max=8824, avg=63.31, stdev=31.35
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   50], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  231],
     | 99.99th=[  289]
   bw (  KiB/s): min=58488, max=66000, per=4.17%, avg=62946.95, stdev=2562.55, samples=19
   iops        : min=14622, max=16500, avg=15736.74, stdev=640.64, samples=19
  lat (usec)   : 4=0.12%, 10=2.73%, 20=0.83%, 50=1.08%, 100=89.58%
  lat (usec)   : 250=5.64%, 500=0.03%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=1.10%, sys=15.89%, ctx=150665, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156747,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21416: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.3MiB/s (64.3MB/s)(613MiB/10001msec)
    clat (usec): min=3, max=507, avg=63.09, stdev=22.02
     lat (usec): min=3, max=508, avg=63.15, stdev=22.02
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  231],
     | 99.99th=[  277]
   bw (  KiB/s): min=58528, max=66400, per=4.18%, avg=63077.95, stdev=2629.53, samples=19
   iops        : min=14632, max=16600, avg=15769.47, stdev=657.37, samples=19
  lat (usec)   : 4=0.13%, 10=2.63%, 20=0.79%, 50=0.97%, 100=89.87%
  lat (usec)   : 250=5.58%, 500=0.03%, 750=0.01%
  cpu          : usr=1.29%, sys=15.82%, ctx=151103, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156989,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21417: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.4MiB/s (64.4MB/s)(614MiB/10001msec)
    clat (usec): min=3, max=671, avg=62.99, stdev=22.31
     lat (usec): min=3, max=671, avg=63.06, stdev=22.31
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  147], 99.50th=[  165], 99.90th=[  215], 99.95th=[  237],
     | 99.99th=[  302]
   bw (  KiB/s): min=59240, max=66416, per=4.19%, avg=63158.74, stdev=2420.27, samples=19
   iops        : min=14810, max=16604, avg=15789.68, stdev=605.07, samples=19
  lat (usec)   : 4=0.13%, 10=2.74%, 20=0.81%, 50=0.86%, 100=89.87%
  lat (usec)   : 250=5.55%, 500=0.03%, 750=0.01%
  cpu          : usr=1.36%, sys=15.84%, ctx=151100, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157253,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21418: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.5MiB/s (64.5MB/s)(615MiB/10001msec)
    clat (usec): min=3, max=949, avg=62.91, stdev=22.09
     lat (usec): min=3, max=949, avg=62.96, stdev=22.09
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  227],
     | 99.99th=[  281]
   bw (  KiB/s): min=59112, max=66264, per=4.19%, avg=63256.00, stdev=2484.55, samples=19
   iops        : min=14778, max=16566, avg=15814.00, stdev=621.14, samples=19
  lat (usec)   : 4=0.18%, 10=2.68%, 20=0.78%, 50=0.85%, 100=89.93%
  lat (usec)   : 250=5.55%, 500=0.03%, 1000=0.01%
  cpu          : usr=1.77%, sys=15.36%, ctx=151428, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157475,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21419: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.4MiB/s (64.4MB/s)(614MiB/10001msec)
    clat (usec): min=3, max=763, avg=63.03, stdev=22.10
     lat (usec): min=3, max=764, avg=63.09, stdev=22.10
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  229],
     | 99.99th=[  269]
   bw (  KiB/s): min=59016, max=66616, per=4.18%, avg=63112.84, stdev=2388.60, samples=19
   iops        : min=14754, max=16654, avg=15778.21, stdev=597.15, samples=19
  lat (usec)   : 4=0.14%, 10=2.71%, 20=0.83%, 50=0.84%, 100=89.86%
  lat (usec)   : 250=5.60%, 500=0.03%, 1000=0.01%
  cpu          : usr=1.32%, sys=15.68%, ctx=151043, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157149,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21420: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.5MiB/s (64.5MB/s)(615MiB/10001msec)
    clat (usec): min=3, max=991, avg=62.94, stdev=22.17
     lat (usec): min=3, max=991, avg=62.99, stdev=22.17
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  212], 99.95th=[  235],
     | 99.99th=[  289]
   bw (  KiB/s): min=59088, max=66160, per=4.19%, avg=63242.11, stdev=2328.23, samples=19
   iops        : min=14772, max=16540, avg=15810.53, stdev=582.06, samples=19
  lat (usec)   : 4=0.18%, 10=2.62%, 20=0.77%, 50=0.73%, 100=90.10%
  lat (usec)   : 250=5.57%, 500=0.03%, 1000=0.01%
  cpu          : usr=1.38%, sys=15.74%, ctx=151488, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157421,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21421: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.4MiB/s (64.4MB/s)(614MiB/10001msec)
    clat (usec): min=3, max=8418, avg=63.08, stdev=30.65
     lat (usec): min=3, max=8418, avg=63.13, stdev=30.65
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  212], 99.95th=[  235],
     | 99.99th=[  302]
   bw (  KiB/s): min=59072, max=66296, per=4.18%, avg=63134.74, stdev=2535.26, samples=19
   iops        : min=14768, max=16574, avg=15783.68, stdev=633.82, samples=19
  lat (usec)   : 4=0.20%, 10=2.60%, 20=0.79%, 50=0.79%, 100=89.96%
  lat (usec)   : 250=5.64%, 500=0.03%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=1.92%, sys=15.16%, ctx=151234, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157191,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21422: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.4MiB/s (64.4MB/s)(614MiB/10002msec)
    clat (usec): min=3, max=941, avg=63.03, stdev=22.17
     lat (usec): min=3, max=942, avg=63.09, stdev=22.17
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  212], 99.95th=[  235],
     | 99.99th=[  285]
   bw (  KiB/s): min=58832, max=66376, per=4.19%, avg=63148.21, stdev=2535.52, samples=19
   iops        : min=14708, max=16594, avg=15787.05, stdev=633.88, samples=19
  lat (usec)   : 4=0.16%, 10=2.66%, 20=0.81%, 50=0.98%, 100=89.80%
  lat (usec)   : 250=5.56%, 500=0.03%, 1000=0.01%
  cpu          : usr=1.35%, sys=15.75%, ctx=151159, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157157,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21423: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.1MiB/s (64.1MB/s)(612MiB/10001msec)
    clat (usec): min=3, max=954, avg=63.27, stdev=22.27
     lat (usec): min=3, max=954, avg=63.33, stdev=22.28
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   55],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   88], 95.00th=[  104],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  206], 99.95th=[  225],
     | 99.99th=[  285]
   bw (  KiB/s): min=58584, max=66240, per=4.17%, avg=62856.00, stdev=2418.83, samples=19
   iops        : min=14646, max=16560, avg=15714.00, stdev=604.71, samples=19
  lat (usec)   : 4=0.15%, 10=2.75%, 20=0.85%, 50=0.69%, 100=89.80%
  lat (usec)   : 250=5.74%, 500=0.02%, 1000=0.01%
  cpu          : usr=1.07%, sys=16.10%, ctx=150355, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156555,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21424: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.3MiB/s (64.3MB/s)(613MiB/10001msec)
    clat (usec): min=3, max=400, avg=63.09, stdev=22.10
     lat (usec): min=3, max=401, avg=63.15, stdev=22.10
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  210], 99.95th=[  235],
     | 99.99th=[  302]
   bw (  KiB/s): min=58768, max=66584, per=4.18%, avg=63104.47, stdev=2732.90, samples=19
   iops        : min=14692, max=16646, avg=15776.11, stdev=683.22, samples=19
  lat (usec)   : 4=0.12%, 10=2.68%, 20=0.79%, 50=0.76%, 100=89.98%
  lat (usec)   : 250=5.64%, 500=0.03%
  cpu          : usr=1.23%, sys=15.79%, ctx=151079, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157002,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21425: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.3MiB/s (64.3MB/s)(614MiB/10001msec)
    clat (usec): min=3, max=360, avg=63.07, stdev=21.94
     lat (usec): min=3, max=360, avg=63.13, stdev=21.94
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  212], 99.95th=[  231],
     | 99.99th=[  285]
   bw (  KiB/s): min=58560, max=66272, per=4.18%, avg=63119.21, stdev=2504.53, samples=19
   iops        : min=14640, max=16568, avg=15779.79, stdev=626.12, samples=19
  lat (usec)   : 4=0.14%, 10=2.60%, 20=0.74%, 50=0.93%, 100=89.97%
  lat (usec)   : 250=5.59%, 500=0.03%
  cpu          : usr=1.64%, sys=15.41%, ctx=151296, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157057,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21426: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.3MiB/s (64.3MB/s)(613MiB/10001msec)
    clat (usec): min=3, max=355, avg=63.09, stdev=21.85
     lat (usec): min=3, max=355, avg=63.15, stdev=21.85
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  161], 99.90th=[  206], 99.95th=[  229],
     | 99.99th=[  277]
   bw (  KiB/s): min=58808, max=66408, per=4.18%, avg=63080.89, stdev=2532.95, samples=19
   iops        : min=14702, max=16602, avg=15770.21, stdev=633.23, samples=19
  lat (usec)   : 4=0.14%, 10=2.66%, 20=0.78%, 50=1.05%, 100=89.79%
  lat (usec)   : 250=5.56%, 500=0.02%
  cpu          : usr=1.37%, sys=15.55%, ctx=151075, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157008,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21427: Thu Aug 21 04:41:17 2025
  read: IOPS=15.8k, BW=61.7MiB/s (64.7MB/s)(617MiB/10005msec)
    clat (usec): min=3, max=4466, avg=62.72, stdev=24.73
     lat (usec): min=3, max=4466, avg=62.79, stdev=24.74
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  143], 99.50th=[  163], 99.90th=[  210], 99.95th=[  233],
     | 99.99th=[  293]
   bw (  KiB/s): min=58088, max=66800, per=4.19%, avg=63193.25, stdev=2822.37, samples=20
   iops        : min=14522, max=16700, avg=15798.30, stdev=705.58, samples=20
  lat (usec)   : 4=0.16%, 10=2.71%, 20=0.83%, 50=1.02%, 100=89.72%
  lat (usec)   : 250=5.53%, 500=0.03%, 1000=0.01%
  lat (msec)   : 10=0.01%
  cpu          : usr=1.69%, sys=15.26%, ctx=151804, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157968,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21428: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.2MiB/s (64.2MB/s)(612MiB/10001msec)
    clat (usec): min=3, max=393, avg=63.21, stdev=21.95
     lat (usec): min=3, max=393, avg=63.27, stdev=21.95
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   88], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  161], 99.90th=[  210], 99.95th=[  233],
     | 99.99th=[  289]
   bw (  KiB/s): min=58688, max=65976, per=4.17%, avg=62905.32, stdev=2543.48, samples=19
   iops        : min=14672, max=16494, avg=15726.32, stdev=635.86, samples=19
  lat (usec)   : 4=0.10%, 10=2.65%, 20=0.80%, 50=0.89%, 100=89.93%
  lat (usec)   : 250=5.60%, 500=0.03%
  cpu          : usr=1.28%, sys=15.76%, ctx=150810, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156678,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21429: Thu Aug 21 04:41:17 2025
  read: IOPS=15.8k, BW=61.8MiB/s (64.8MB/s)(618MiB/10001msec)
    clat (usec): min=3, max=619, avg=62.59, stdev=21.79
     lat (usec): min=3, max=620, avg=62.67, stdev=21.79
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  102],
     | 99.00th=[  143], 99.50th=[  161], 99.90th=[  206], 99.95th=[  223],
     | 99.99th=[  269]
   bw (  KiB/s): min=59784, max=66640, per=4.21%, avg=63516.26, stdev=2313.57, samples=19
   iops        : min=14946, max=16660, avg=15879.05, stdev=578.38, samples=19
  lat (usec)   : 4=0.15%, 10=2.72%, 20=0.78%, 50=1.00%, 100=89.91%
  lat (usec)   : 250=5.43%, 500=0.02%, 750=0.01%
  cpu          : usr=1.75%, sys=15.07%, ctx=152072, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=158161,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21430: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.4MiB/s (64.4MB/s)(614MiB/10001msec)
    clat (usec): min=3, max=978, avg=63.02, stdev=21.98
     lat (usec): min=3, max=978, avg=63.08, stdev=21.98
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  143], 99.50th=[  161], 99.90th=[  208], 99.95th=[  233],
     | 99.99th=[  297]
   bw (  KiB/s): min=59088, max=65952, per=4.18%, avg=63097.26, stdev=2307.26, samples=19
   iops        : min=14772, max=16488, avg=15774.32, stdev=576.81, samples=19
  lat (usec)   : 4=0.14%, 10=2.74%, 20=0.80%, 50=0.68%, 100=90.11%
  lat (usec)   : 250=5.50%, 500=0.03%, 1000=0.01%
  cpu          : usr=1.70%, sys=15.35%, ctx=151064, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157168,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21431: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.1MiB/s (64.1MB/s)(611MiB/10001msec)
    clat (usec): min=3, max=1070, avg=63.29, stdev=22.11
     lat (usec): min=3, max=1071, avg=63.34, stdev=22.11
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   88], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  206], 99.95th=[  231],
     | 99.99th=[  289]
   bw (  KiB/s): min=58080, max=66264, per=4.16%, avg=62835.37, stdev=2596.29, samples=19
   iops        : min=14520, max=16566, avg=15708.84, stdev=649.07, samples=19
  lat (usec)   : 4=0.13%, 10=2.60%, 20=0.82%, 50=0.99%, 100=89.81%
  lat (usec)   : 250=5.62%, 500=0.03%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.53%, sys=15.31%, ctx=150674, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156533,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21432: Thu Aug 21 04:41:17 2025
  read: IOPS=15.6k, BW=61.1MiB/s (64.0MB/s)(611MiB/10001msec)
    clat (usec): min=3, max=407, avg=63.35, stdev=22.09
     lat (usec): min=3, max=407, avg=63.40, stdev=22.09
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   88], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  165], 99.90th=[  208], 99.95th=[  227],
     | 99.99th=[  285]
   bw (  KiB/s): min=59040, max=66256, per=4.16%, avg=62825.26, stdev=2498.62, samples=19
   iops        : min=14760, max=16564, avg=15706.32, stdev=624.66, samples=19
  lat (usec)   : 4=0.15%, 10=2.67%, 20=0.79%, 50=0.86%, 100=89.83%
  lat (usec)   : 250=5.68%, 500=0.02%
  cpu          : usr=1.49%, sys=15.47%, ctx=150451, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21433: Thu Aug 21 04:41:17 2025
  read: IOPS=15.8k, BW=61.8MiB/s (64.8MB/s)(618MiB/10001msec)
    clat (usec): min=3, max=490, avg=62.58, stdev=21.94
     lat (usec): min=3, max=491, avg=62.65, stdev=21.94
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   50], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   56], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  102],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  212], 99.95th=[  231],
     | 99.99th=[  281]
   bw (  KiB/s): min=59352, max=66704, per=4.21%, avg=63598.79, stdev=2522.93, samples=19
   iops        : min=14838, max=16676, avg=15899.68, stdev=630.73, samples=19
  lat (usec)   : 4=0.14%, 10=2.66%, 20=0.84%, 50=1.16%, 100=89.73%
  lat (usec)   : 250=5.44%, 500=0.02%
  cpu          : usr=1.77%, sys=15.23%, ctx=152179, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=158260,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21434: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.5MiB/s (64.5MB/s)(615MiB/10001msec)
    clat (usec): min=3, max=861, avg=62.95, stdev=22.03
     lat (usec): min=3, max=861, avg=63.01, stdev=22.03
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   50], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  229],
     | 99.99th=[  281]
   bw (  KiB/s): min=59144, max=66600, per=4.19%, avg=63225.26, stdev=2465.55, samples=19
   iops        : min=14786, max=16650, avg=15806.32, stdev=616.39, samples=19
  lat (usec)   : 4=0.14%, 10=2.67%, 20=0.80%, 50=1.25%, 100=89.59%
  lat (usec)   : 250=5.53%, 500=0.02%, 1000=0.01%
  cpu          : usr=1.75%, sys=15.07%, ctx=151362, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157372,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21435: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.2MiB/s (64.1MB/s)(612MiB/10001msec)
    clat (usec): min=3, max=362, avg=63.25, stdev=22.16
     lat (usec): min=3, max=362, avg=63.32, stdev=22.16
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   56], 40.00th=[   57], 50.00th=[   59], 60.00th=[   61],
     | 70.00th=[   64], 80.00th=[   73], 90.00th=[   88], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  165], 99.90th=[  212], 99.95th=[  231],
     | 99.99th=[  289]
   bw (  KiB/s): min=58656, max=66120, per=4.17%, avg=62912.05, stdev=2587.61, samples=19
   iops        : min=14664, max=16530, avg=15728.00, stdev=646.89, samples=19
  lat (usec)   : 4=0.12%, 10=2.72%, 20=0.80%, 50=1.05%, 100=89.59%
  lat (usec)   : 250=5.69%, 500=0.02%
  cpu          : usr=1.50%, sys=15.32%, ctx=150562, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=156566,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21436: Thu Aug 21 04:41:17 2025
  read: IOPS=15.8k, BW=61.9MiB/s (64.9MB/s)(619MiB/10001msec)
    clat (usec): min=3, max=345, avg=62.51, stdev=21.93
     lat (usec): min=3, max=345, avg=62.58, stdev=21.93
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   50], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   56], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   63], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  161], 99.90th=[  206], 99.95th=[  225],
     | 99.99th=[  273]
   bw (  KiB/s): min=60104, max=66696, per=4.22%, avg=63619.84, stdev=2373.07, samples=19
   iops        : min=15026, max=16674, avg=15904.95, stdev=593.26, samples=19
  lat (usec)   : 4=0.14%, 10=2.75%, 20=0.86%, 50=1.07%, 100=89.67%
  lat (usec)   : 250=5.49%, 500=0.02%
  cpu          : usr=1.28%, sys=15.81%, ctx=152107, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=158383,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=21437: Thu Aug 21 04:41:17 2025
  read: IOPS=15.7k, BW=61.5MiB/s (64.5MB/s)(615MiB/10001msec)
    clat (usec): min=3, max=847, avg=62.90, stdev=22.00
     lat (usec): min=3, max=847, avg=62.99, stdev=22.00
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[   51], 10.00th=[   52], 20.00th=[   54],
     | 30.00th=[   55], 40.00th=[   57], 50.00th=[   58], 60.00th=[   60],
     | 70.00th=[   64], 80.00th=[   72], 90.00th=[   87], 95.00th=[  103],
     | 99.00th=[  145], 99.50th=[  163], 99.90th=[  208], 99.95th=[  227],
     | 99.99th=[  273]
   bw (  KiB/s): min=58656, max=66304, per=4.19%, avg=63222.37, stdev=2598.28, samples=19
   iops        : min=14664, max=16576, avg=15805.58, stdev=649.56, samples=19
  lat (usec)   : 4=0.14%, 10=2.69%, 20=0.77%, 50=1.01%, 100=89.81%
  lat (usec)   : 250=5.56%, 500=0.02%, 1000=0.01%
  cpu          : usr=1.54%, sys=15.63%, ctx=151450, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=157412,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1474MiB/s (1545MB/s), 61.1MiB/s-61.9MiB/s (64.0MB/s-64.9MB/s), io=14.4GiB (15.5GB), run=10001-10005msec

Disk stats (read/write):
  nvme0n1: ios=3742738/0, merge=0/0, ticks=210910/0, in_queue=210909, util=98.94%